In [1]:
# dataframe to table
import pandas as pd 
from sqlalchemy import create_engine #sqlalchemy helped convert strings to dates seamlessly

#cnx = pymysql.connect(user='dev', password='ax2',host='127.0.0.1',port=3307,db='test') 
con_str = "mysql+mysqlconnector://root:root@db/db"
engine = create_engine(con_str)
#connection = engine.raw_connection()
df = pd.DataFrame({'firstname' : ['Ulrik', 'Ulla', 'Ulfred'],
                  'lastname':['Volborg','Willman','Valberg'],
                  'startdate':['2003-03-03','2001-05-04','2001-01-04'],
                  'enddate':['2005-08-20','2005-12-24','2006-10-30'],
                  'salary':['21000', '32000', '43000']})
df = df.applymap(str)
df.to_sql('pythondemo',con=engine, if_exists='append', index = False)
df

  firstname lastname   startdate     enddate salary
0     Ulrik  Volborg  2003-03-03  2005-08-20  21000
1      Ulla  Willman  2001-05-04  2005-12-24  32000
2    Ulfred  Valberg  2001-01-04  2006-10-30  43000

In [2]:
import sqlalchemy as s_a
SQLALCHEMY_DATABASE_URL = "mysql+mysqlconnector://root:root@db/db"
engine = s_a.create_engine(SQLALCHEMY_DATABASE_URL)
connection = engine.connect()
query = 'select * from pythondemo'
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()
ResultSet[:]

[(1, 'Henny', 'Petersen', datetime.datetime(2002, 2, 2, 0, 0), datetime.datetime(2002, 2, 3, 23, 0), 5000.0),
 (2, 'Hassan', 'Hassani', datetime.datetime(2018, 7, 7, 0, 0), None, 6000.0),
 (3, 'Hanne', 'Hansen', datetime.datetime(2002, 4, 3, 0, 0), None, 7000.0),
 (4, 'Jesper', 'FÃ¥rekylling', datetime.datetime(2002, 4, 3, 0, 0), datetime.datetime(2018, 7, 6, 22, 0), 4000.0),
 (5, 'Ulrik', 'Volborg', datetime.datetime(2003, 3, 3, 0, 0), datetime.datetime(2005, 8, 20, 0, 0), 21000.0),
 (6, 'Ulla', 'Willman', datetime.datetime(2001, 5, 4, 0, 0), datetime.datetime(2005, 12, 24, 0, 0), 32000.0),
 (7, 'Ulfred', 'Valberg', datetime.datetime(2001, 1, 4, 0, 0), datetime.datetime(2006, 10, 30, 0, 0), 43000.0),
 (8, 'Ulrik', 'Volborg', datetime.datetime(2003, 3, 3, 0, 0), datetime.datetime(2005, 8, 20, 0, 0), 21000.0),
 (9, 'Ulla', 'Willman', datetime.datetime(2001, 5, 4, 0, 0), datetime.datetime(2005, 12, 24, 0, 0), 32000.0),
 (10, 'Ulfred', 'Valberg', datetime.datetime(2001, 1, 4, 0, 0), datetime.datetime(2006, 10, 30, 0, 0), 43000.0)]